<pad>
</s>
[Cu-2]
[V+4]
0
1
2
3
4
5
6
7
8
9
#
%
<
=
a
al
B
Br
c
C
Cl
F
I
n
o
P
p
s
S
i
10%
11%
12%
13%
14%
15%
16%
17%
18%
19%
20%
21%
22%
23%
24%
25%
26%
27%
28%
29%
30%
31%
32%
33%
34%
35%
36%
37%
38%
(
)
-
F
I
N
O
P
S
[Ac]
[Ag]
[Ag-]
[Ag+]
[AgH]
[Al]
[Al-]
[Al+3]
[Al-2]
[Al-3]
[AlH]
[AlH+2]
[AlH2]
[AlH2+]
[AlH3]
[AlH4-]
[Am]
[Ar]
[As]
[As-]
[As+]
[As+3]
[As+5]
[AsH]
[AsH2]
[AsH3]
[At]
[AtH]
[Au]
[Au-]
[Au+]
[Au+3]
[B]
[B-]
[Ba]
[Ba+2]
[Be]
[Be+2]
[BH-]
[BH2]
[BH2-]
[BH3-]
[BH4-]
[Bi]
[Bi+2]
[Bi+3]
[BiH]
[BiH2]
[BiH3]
[Bk]
[Br-]
[C]
[C-]
[C+]
[Ca]
[Ca+2]
[Cd]
[Cd+2]
[Ce]
[Ce+3]
[Ce+4]
[Cf]
[CH]
[CH-]
[CH+]
[CH2]
[CH2-]
[CH2+]
[CH3]
[CH3-]
[CH3+]
[Cl-]
[Cl+3]
[ClH+]
[ClH2+]
[Cm]
[Co]
[Co+]
[Co+2]
[Co+3]
[CoH2]
[Cr]
[Cr+2]
[Cr+3]
[Cr+4]
[Cr+5]
[Cr+6]
[Cs]
[Cs+]
[Cu]
[Cu+]
[Cu+2]
[Dy]
[Dy+3]
[Er]
[Er+3]
[Es]
[Eu]
[Eu+2]
[Eu+3]
[F-]
[Fe]
[Fe-]
[Fe+]
[Fe+2]
[Fe+3]
[Fe+6]
[Fe-3]
[FeH]
[FeH2]
[Fm]
[Ga]
[Ga+3]
[GaH]
[GaH2]
[GaH3]
[Gd]
[Gd+3]
[Ge]
[Ge-2]
[GeH]
[GeH2]
[GeH3]
[GeH4]
[H-]
[H+]
[He]
[Hf]
[Hf+4]
[Hg]
[Hg-]
[Hg+]
[Hg+2]
[Hg-2]
[HH]
[Ho]
[Ho+3]
[I-]
[I+]
[IH+]
[IH2+]
[In]
[In+3]
[InH]
[InH2]
[InH3]
[Ir]
[Ir+3]
[Ir-2]
[IrH+2]
[K]
[K+]
[Kr]
[La]
[La+3]
[Li]
[Li-]
[Li+]
[Lr]
[Lu]
[Lu+3]
[Md]
[Mg]
[Mg+2]
[Mn]
[Mn+2]
[Mn+3]
[Mo]
[Mo+2]
[Mo+3]
[Mo+4]
[MoH2]
[N]
[N-]
[N+]
[Na]
[Na+]
[Nb]
[Nb+2]
[Nb+5]
[Nd]
[Nd+3]
[Ne]
[NH]
[NH-]
[NH+]
[nH+]
[NH2]
[NH2-]
[NH2+]
[NH3+]
[NH4+]
[Ni]
[Ni-]
[Ni+]
[Ni+2]
[Ni+3]
[NiH]
[No]
[Np]
[O]
[O-]
[O+]
[O-2]
[OH]
[OH-]
[OH+]
[OH2+]
[OH3+]
[Os]
[Os+]
[Os+2]
[Os+4]
[Os+6]
[Os+7]
[Os+8]
[OsH]
[P]
[P-]
[P+]
[P-3]
[Pa]
[Pb]
[Pb+2]
[PbH]
[PbH2]
[PbH4]
[Pd]
[Pd+]
[Pd+2]
[Pd-2]
[PH+]
[PH2]
[PH2-]
[PH2+]
[PH4+]
[Pm]
[PoH2]
[Pr]
[Pr+3]
[Pt]
[Pt+]
[Pt+2]
[Pt+4]
[Pt-2]
[PtH]
[Pu]
[Rb]
[Rb+]
[Re]
[ReH]
[Rh]
[Rh-]
[Rh+]
[Rh+2]
[Rh+3]
[Rh-2]
[Rn]
[Ru]
[Ru-]
[Ru+]
[Ru+2]
[Ru+3]
[Ru+4]
[Ru+5]
[Ru+6]
[Ru+8]
[Ru-2]
[Ru-3]
[RuH]
[S]
[S-]
[S+]
[S-2]
[Sb]
[Sb-]
[Sb+]
[Sb+3]
[SbH]
[SbH2]
[SbH3]
[Sc]
[Sc+3]
[Se]
[Se-]
[Se+]
[Se+4]
[Se+6]
[Se-2]
[SeH]
[SeH2]
[SH]
[SH-]
[SH+]
[SH2+]
[SH3+]
[Si]
[Si-]
[Si+]
[Si+4]
[Si-2]
[SiH]
[SiH-]
[SiH2]
[SiH3]
[SiH3-]
[SiH4]
[Sm]
[Sm+3]
[Sn]
[Sn-]
[Sn+]
[Sn+2]
[Sn+3]
[Sn+4]
[SnH]
[SnH2]
[SnH3]
[SnH4]
[Sr]
[Sr+2]
[Ta]
[Ta+2]
[Ta+5]
[Ta-2]
[TaH2]
[Tb]
[Tb+3]
[Tc]
[Tc+]
[Tc+3]
[Tc+4]
[Tc+5]
[Tc+6]
[Tc+7]
[Te]
[Te+]
[Te+4]
[TeH]
[TeH2]
[Th]
[Th+2]
[Th+4]
[Ti]
[Ti+]
[Ti+2]
[Ti+3]
[Ti+4]
[Tl]
[Tl+]
[Tl+3]
[TlH]
[TlH3]
[Tm]
[Tm+3]
[U]
[U+2]
[V]
[V+2]
[W]
[W+]
[W+2]
[WH2]
[Xe]
[Y]
[Y+3]
[Yb]
[Yb+2]
[Yb+3]
[Zn]
[Zn-]
[Zn+]
[Zn+2]
[Zn-2]
[Zr]
[Zr-]
[Zr+2]
[Zr+3]
[Zr+4]
[ZrH]
[B-]
[BH-]
[BH2-]
[BH3-]
[BH4-]
[Br+2]
[Br+3]
[Br+]
[Br-]
[C+]
[C-]
[CH+]
[CH-]
[CH2+]
[CH2-]
[CH3-]
[Cl+2]
[Cl+3]
[Cl+]
[F-]
[I+2]
[I+3]
[I+]
[I-]
[N+]
[N-]
[NH+]
[NH-]
[NH2+]
[NH2-]
[NH3+]
[NH4+]
[N]
[O+]
[O-2]
[O-]
[OH+]
[OH-]
[OH2+]
[OH3+]
[OH]
[O]
[P+]
[P-3]
[P-]
[PH+]
[PH2+]
[PH2-]
[PH2]
[PH4+]
[PH]
[S+]
[S-2]
[S-]
[SH+]
[SH-]
[SH2+]
[SH]
[nH]
[Sn]
[Si]
[Ag]
[SeH]
[Cu+2]
[Al]
[Ni+3]
[Zr+2]
[Cu]
[CH]
[C]
[SiH]
[Se]
[Y+3]
C
(
=
O
)
[O-]
[N+]
1
N
P
Cl
2
3
4
S
#
5
6
7
[N-]
[NH4+]
[As]
[Br-]
Br
[Ca+2]
[C-]
[O+]
[Cl-]
.
[Co]
[S+]
[SeH2]
[Hg]
[NH3+]
[HH]
I
[K+]
[SeH]
[CH3-]
[Mg+2]
[Na+]
[Ni+2]
[Ni]
[OH-]
[H+]
[Se]
[Fe+3]
[W]
[NH+]
B
[NH2+]
F
[OH+]
[B-]
[S-]
8
[Si]
[Te]
[Al]
9
[Cd]
[Pt]
[NH2-]
[Pt+2]
[Co+2]
[NH-]
[Rh+2]
[I+]
[Ni+3]
[Fe+2]
[Li+]
[Be+2]
[F-]
[Mn+3]
[I-]
[Pr]
[Ag+]
[CH-]
[Tc+6]
[Kr]
[Hg+]
[Zn]
[SnH]
[Au+]
[Al+3]
[SiH]
[Pb]
[Sn]
[SnH2]
[BiH]
[AlH2]
[CH2-]
[P+]
[Zn+2]
[Sr+2]
[Cu+2]
[Ce]
[Cd+2]
[Cu]
[Bi]
[BiH3]
[SiH2]
[Fe]
[Pb+2]
[Sn+2]
[SbH3]
[P-]
[Si+]
[Ce+3]
[Ba+2]
[Cs+]
[AlH4-]
[U]
[Cu+]
[Ti+4]
[Sb]
[AlH]
[Tl+]
[Hg+2]
[Rb+]
[Hg-2]
[AsH2]
[Ge]
[Mn+2]
[AsH]
[SiH3]
[Bi+3]
[Cr+2]
[La+3]
[Cr+3]
[As+]
[PbH]
[AlH3]
[C]
[Al-]
[Ga]
[Be]
[Ca]
[P-3]
[Cr]
[Mg]
[O-2]
[Sb+3]
[SH-]
[Mn]
[Mo]
[S-2]
[Th]
[V]
[U+2]
[Sr]
[As+3]
[Sn+]
[SnH3]
[GeH]
[Zr]
[In+3]
[TeH2]
[Nd+3]
[As-]
[Dy]
[Es]
[Ir]
[La]
[PbH2]
[Lu]
[Np]
[Nd]
[Ne]
[Nb]
[Os]
[Pd]
[Pu]
[PoH2]
[Md]
[Pm]
[Pa]
[Re]
[Rh]
[Ru]
[Sm]
[Sc]
[SiH4]
[Ag]
[Ta]
[Tc]
[Tb]
[TlH]
[Tm]
[Ti]
[Ac]
[Am]
[Ar]
[AsH3]
[Bk]
[Cm]
[Er]
[Eu]
[Gd]
[GaH3]
[GeH4]
[Au]
[Hf]
[He]
[Ho]
[Xe]
[Yb]
[Y]
[AtH]
[Cf]
[Fm]
[InH3]
[Zr+4]
[Se+]
[Al-3]
[Tl]
[CH+]
[CH]
[H-]
[In]
[No]
[Tb+3]
[Rn]
[O]
[Lu+3]
[Pd+2]
[Eu+3]
[Dy+3]
[Ho+3]
[Au+3]
[Sm+3]
[Y+3]
[Fe-3]
[Th+4]
[Au-]
[Sn-]
[Fe-]
[Tl+3]
[Sn+3]
[Si-2]
[BH4-]
[Ta-2]
[Ir-2]
[Cr+6]
[Te+4]
[Lr]
[N]
[V+2]
[Ga+3]
[Ge-2]
[Pt+4]
[Si-]
[Gd+3]
[Tc+3]
[Co+3]
[Pd-2]
[Pt-2]
[Sn+4]
[Er+3]
[Pd+]
[Se-2]
[Yb+3]
[Zn-2]
[Ta+5]
[Ba]
[Sc+3]
[SbH]
[Se+4]
[PH2-]
[Si+4]
[Ru+2]
[Ce+4]
[GeH2]
[Tm+3]
[Sb+]
[Se-]
[Ti+]
[Os+2]
[Ir+3]
[Ru+3]
[Pr+3]
[Na]
[K]
[Li]
[Rh+3]
[InH]
[Cs]
[Rb]
[Yb+2]
[Pt+]
[Ti+2]
[Mo+2]
[Ti+3]
[OH2+]
[Zr+2]
[C+]
[IrH+2]
[Mo+4]
[Eu+2]
[AlH2+]
[As+5]
[Sb-]
[Se+6]
[Cr+5]
[PH2]
[V+4]
[Ru+5]
[Li-]
[AlH+2]
[BH3-]
[CH2]
[SnH4]
[S]
[PbH4]
[TeH]
[NH2]
[OH3+]
%
0
[At]
[ReH]
[WH2]
[MoH2]
[GeH3]
[CH3]
[NH]
[SH]
[B]
[AgH]
[TlH3]
[BH2]
[SH2+]
[Hf+4]
[Nb+5]
[FeH2]
[Cr+4]
[TaH2]
[GaH2]
[GaH]
[Th+2]
[P]
[Rh-]
[SH+]
[Rh+]
[Ru-]
[Rh-2]
[Tc+4]
[OH]
[Ru+]
[InH2]
[Zn-]
[Nb+2]
[Ru+4]
[Os+4]
[PH4+]
[SiH3-]
[Zr-]
[Cu-2]
[Ta+2]
[Zr+3]
[Ni-]
[Al-2]
[Ru-2]
[CH2+]
[Ag-]
[Hg-]
[Tc+7]
[Os+8]
[SbH2]
[Mo+3]
[BiH2]
[Cl+3]
[Zn+]
[Fe+]
[Ru+6]
[BH-]
[Ni+]
[BH2-]
[Co+]
[PtH]
[Os+6]
[Ru+8]
[Te+]
[Bi+2]
[RuH]
[ZrH]
[SiH-]
[IH2+]
[ClH+]
[ClH2+]
[Os+7]
[SH3+]
[Os+]
[Tc+]
[Tc+5]
[IH+]
[PH+]
[Ru-3]
[W+2]
[PH2+]
a
n
o
i
c
al
<
[FeH]
[CoH2]
[W+]
[Fe+6]
[NiH]
[OsH]
[CH3+]
[PH-]
[I]
[Br]
[PH3+]
[Cu-]
[PbH2+2]
[Mn+]
[Ir+2]
[B+]
[Cd-2]
[CuH]
[Re-]
[Re-2]
[TlH2]
[SeH2+]
[Ga-]
[Ir+]
[RhH]
[Gd+2]
[ZrH2]
[Os+5]
[Te-]
[Ni-2]
[Rh-3]
[RhH+2]
[Hf+2]
[Mn-2]
[Cr+]
[Co-2]
[Nb-2]
[Fe-2]
[OsH2]
[PtH2]
[WH]
[RhH2]
[Ti-2]
[Bi+]
[SeH+]
[Al+2]
[SeH-]
[Nb+3]
[ClH]
[TaH]
[In-]
[Pt-]
[Tc+2]
[Nb-]
[Mo+]
[Ta-]
[Al+]
[NbH2]
[Pd-]
[FeH6-4]
[MoH]
[W-]
[In+]
[SbH+]
[AsH3+]
[Cl]
[F]
[H]
[PbH3]
[SnH3-]
[SeH3+]
[SeH3]
[TeH3+]
[TeH3]
[Ni-3]
[SbH4+]
[SbH4]
[AsH4+]
[BH4+]
[BH3+]
[PH-2]
[AsH3-]
[AsH2+]
[Cl+]
[Cr-3]
[Cr-2]
[Fe-4]
[Mo-2]
[SiH2-]
[SiH2+]
[SnH2+]
[BiH2+2]
[Os-]
[PtH+]
[SbH5]
[Po]
[Ra]
[Fr]
[AlH-]
[AlH2-]
[RuH+2]
[SnH+3]
[BiH2+]
[AsH-]
[RuH2+2]
[BH]
[PH]
[Os-2]
[SiH3+]
[SnH3+]
[TeH2+]
[AsH5]
[TeH+]
[Si+3]
[Cr-]
[Si+2]
[Zr+]
[Co-]
[Ir-3]
[Mg+]
[V+]
[Bi-]
[Tb+4]
[P-2]
[SnH+2]
[Fe+5]
[Fe+4]
[BiH5]
[RuH+]
[RuH2]
[AlH6-3]
[IrH3]
[IrH4]
[ReH2]
[NbH3]
[RuH3]
[ReH3]
[IrH]
[IrH2]
[ZnH2]
[CrH2]
[LaH3]
[SmH3]
[EuH3]
[OsH-]
[OsH3]
[WH4]
[MoH5]
[RuH4]
[TaH3]
[MoH3]
[FeH4]
[MoH4]
[HgH2]
[ThH2]
[TiH2]
[AuH]
[ZrH3]
[ReH7]
[UH2]
[OsH4]
[GaH4-]
[ThH4]
[WH6]
[RuH6]
[PdH2]
[PtH4]
[NiH2]
[VH2]
[PtH3]
[RhH3]
[UH3]
[MnH2]
[CuH2]
[CoH3]
[FeH3]
[TiH4]
[RuH5]
[BiH4]
[ReH4]
[HgH]
[WH3]
[CeH3]
[SnH2+2]
[Hf+]
[SnH+]
[Ge-]
[Bi-2]
[AlH3-]
[PtH2+2]
[Zr-2]
[ClH4+3]
[IH]
[Co-3]
[Pr+]
C
(
N
=
O
)
c
1
o
-
2
s
n
Br
[N+]
[O-]
3
F
[nH]
S
Cl
#
[C-]
4
I
[N-]
B
[n+]
5
[nH+]
[NH2+]
[NH+]
[I-]
[P+]
[CH2-]
[CH-]
P
[NH3+]
[SH2+]
[NH-]
[c-]
6
[B-]
[o+]
[S-]
[PH2+]
[PH]
[OH2+]
[cH-]
p
[OH+]
[s+]
7
[PH+]
[n-]
[S+]
[BH-]
[I+]
[Cl+]
[IH+]
[C+]
[ClH+]
[O+]
[PH3+]
[P-]
[SH+]
[CH+]
[c+]
[pH]
[Cl+2]
[b-]
[CH2+]
[BH2-]
b
[Br+2]
[BH3-]
[p+]
[Cl+3]
[SH2]
[cH+]
[PH-]
[sH+]
8
[SH]
[p-]
[IH-]
[IH]
[I+2]
9
%
0
[oH+]
[pH+]
[Br+]
[I+3]
[SH-]
[BrH]
[Os-3]
[Ti-]
[SH2]
[BiH4-]
[TeH4]
[Zr-4]
[Zr-3]
[Ta+]
[U+4]
[U+3]
[SH3]
[ZrH2+2]
[Bh]
[Hs]
[Rf]
[Mt]
[Sg]
[Db]
[AsH4]
[UH]
[YH2]
[YH]
[IH3-]
[IH-]
[RuH+3]
[YH3]
[VH]
[IH2-]
[ClH3]
[ZnH]
[PdH]
[ClH2]
[ClH-]
[IH2]
[PH3]
[PH4]
[PH5]
[PH5-]
[IH3]
[BrH2-]
[BrH-]
[VH3]
[Ca+]
[ZnH+]
[IH4]
[IH6]
[Ba+]
[MnH]
[IH7]
[IH4-]
[IH5]
[GdH2]
[BrH2]
[SH4]
[CuH+]
[TiH+3]
[PdH+]
[CoH]
[ClH2+2]
[Ge+4]
[Sb+5]
[SeH5]
[AlH+]
[ClH3+2]
[TiH]
[TiH+]
[ClH3+3]
[ClH+2]
[Cd-]
[SiH+]
[XeH]
[GeH3-]
[KrH]
[AsH+]
[AsH2-]
[SiH4-]
[SnH2-]
[YbH2]
[CrH+2]
[CuH2-]
[Cl+2]
[CoH+]
[SiH2-2]
*
[Sr-]
[Cf+3]
[SiH-2]
[SiH3-2]
[SnH-]
[MnH+]
[CoH+2]
[NiH2+2]
[PoH]
[SbH3+]
[AuH3]
[XeH2]
[BH2+]
[ScH3]
[ClH6]
[ClH4]
[ClH3-]
[ClH7]
[Ru-4]
[SbH2+]
[RuH-]
[ArH]
<unk>
<sos>
<eos>
>
.